
	.186
	.model	tiny,stdcall


;****************************************************************
;*		外部宣言					*
;****************************************************************
include	lib_dos.inc


;****************************************************************
;*		コード						*
;****************************************************************
;---------------------------------------------------------------|
;		ファイル名の拡張子変更				|
;---------------------------------------------------------------|
;	●引数							|
;		cFilename	拡張子付きファイル名		|
;		cExt		変更後の拡張子(3文字で)		|
;	●返り値						|
;		cFilename	拡張子変更後　ファイル名	|
;---------------------------------------------------------------|
.code
ChangeExt	proc	near	uses ax cx si di ds es,
	cFilename:dword,
	cExt:dword

	les	di,cFilename
	lds	si,cExt

	mov	al,'.'			;
	mov	cx,085h			;
	repnz	scasb			;拡張子を捜す

	mov	cx,3			;
	rep	movsb			;
	mov	al,0			;
	stosb				;
	mov	al,24h			;
	stosb				;書き換える

	ret
ChangeExt	endp
;****************************************************************
	end
