
	.186
	.model	tiny,stdcall


;****************************************************************
;*		外部宣言					*
;****************************************************************
include	lib_dos.inc


;****************************************************************
;*		コード						*
;****************************************************************
;---------------------------------------------------------------|
;		１６進数コード～ASCII CODE(FF)			|
;---------------------------------------------------------------|
;	処理							|
;		１６進コードを１６進のアスキーコードに変換	|
;	引数							|
;		AL←変換したい数値				|
;	返り値							|
;		CS:DX←変換した文字列の先頭アドレス		|
;	コメント						|
;		この書き方は、書いたの近頃だ。			|
;---------------------------------------------------------------|
.data
dat2hex8_Print	db	'00$'
.code
dat2hex8	proc	near	uses ax

		mov	ah,al		;
		shr	al,4		;ah←下位4bit
		and	ax,0f0fh	;al←上位4bit

		cmp	al,0ah		;
		jc	dat2hex8_Low	;下位4bitは0x0A以下？
		add	al,7		;
dat2hex8_Low:				;
		cmp	ah,0ah		;
		jc	dat2hex8_Hi	;上位4bitは0x0A以下？
		add	ah,7		;
dat2hex8_Hi:				;
		add	ax,3030h	;

		mov	word ptr cs:[dat2hex8_Print],ax

		push	cs		;
		pop	ds		;ds:dx←far &(dat2hex8_Print)
		mov	dx,offset dat2hex8_Print

		ret			;
dat2hex8	endp			;
;****************************************************************
	end
