
	.186
	.model	tiny,stdcall


;****************************************************************
;*		外部宣言					*
;****************************************************************
include	lib_dos.inc


;****************************************************************
;*		コード						*
;****************************************************************
;---------------------------------------------------------------|
;		ファイルのロード				|
;---------------------------------------------------------------|
;	●引数							|
;		hFile	ハンドル				|
;		cBuff	バッファのアドレス			|
;	●返り値						|
;		ax	読み込めたバイト数			|
;---------------------------------------------------------------|
.code
File_Load_s	proc	near	uses bx cx dx ds,
		hFile:word,
		iSize:word,
		cBuff:dword

		lds	dx,dword ptr cBuff
		mov	cx,iSize	;
		mov	bx,hFile	;bx←ハンドル
		mov	ah,3fh		;
		int	21h		;

		jnc	File_Load_Ok	;
		call	File_Err	;
File_Load_Ok:				;
		ret			;
File_Load_s	endp			;
;****************************************************************
	end
