
	.186
	.model	tiny,stdcall


;****************************************************************
;*		外部宣言					*
;****************************************************************
include	lib_dos.inc


;****************************************************************
;*		コード						*
;****************************************************************
;---------------------------------------------------------------|
;		ファイルのロード				|
;---------------------------------------------------------------|
;	●引数							|
;		hFile		ハンドル			|
;		iControl	0 : 先頭から			|
;				1 : 現在の位置から		|
;				2 : 末尾から			|
;		dOffset		オフセット			|
;	●返り値						|
;		ds::ax	移動後のポインタ			|
;---------------------------------------------------------------|
.code
File_Seek	proc	near	uses bx cx,
		hFile	:word,
		iControl:BYTE,
		dOffset	:dword

		mov	dx, word ptr [dOffset + 0]
		mov	cx, word ptr [dOffset + 2]
		mov	bx, hFile	;bx←ハンドル
		mov	al, iControl	;操作子
		mov	ah, 42h		;
		int	21h		;

		jnc	File_Seek_Ok	;
		call	File_Err	;
File_Seek_Ok:				;
		ret			;
File_Seek	endp			;
;****************************************************************
	end
