
	.186
	.model	tiny,stdcall


;****************************************************************
;*		外部宣言					*
;****************************************************************
include	lib_dos.inc


;****************************************************************
;*		コード						*
;****************************************************************
;---------------------------------------------------------------|
;		ファイルのライト				|
;---------------------------------------------------------------|
;	●引数							|
;		hFile	ハンドル				|
;		iSize	書き込みバイト数			|
;		cBuff	バッファのアドレス			|
;	●返り値						|
;		無し						|
;---------------------------------------------------------------|
.code
File_Write	proc	near	uses ax bx cx dx ds,
		hFile:word,
		iSize:word,
		cBuff:dword

		lds	dx,dword ptr cBuff
		mov	cx,iSize	;cx←サイズ
		mov	bx,hFile	;bx←ハンドル
		mov	ah,040h		;
		int	21h		;

		jnc	File_Write_Ok	;
		call	File_Err	;
File_Write_Ok:				;
		ret			;
File_Write	endp			;
;****************************************************************
	end
